{'Instruction': 'What is the difference between a petition and a plaint in Indian law?', 'Response': "A petition is a formal request submitted to a courttribunalor authority to seek a specific remedy or relief. It is commonly used for various purposessuch as filing a writ petition in the High Court or submitting a petition for divorce. On the other handa plaint is a formal written statement of a plaintiff's claim in a civil lawsuit. The key difference is that a petition is more versatile and can be used for various legal matterswhile a plaint is specific to civil cases."}
{'Instruction': 'When should a writ petition be filed in India?', 'Response': 'A writ petition in India should be filed when a fundamental right of an individual is violatedor when there is an issue related to the violation of a legal or constitutional right. Common examples include filing a writ of habeas corpus for unlawful detentiona writ of mandamus to compel a public authority to perform its dutiesor a writ of certiorari to quash an order.'}
{'Instruction': 'What is the procedure for filing a plaint in a civil case in India?', 'Response': 'To file a plaint in a civil case in Indiayou must follow these steps:Prepare a written statement of your claimincluding all relevant facts and legal grounds.Pay the prescribed court fees based on the value of the subject matter of the suit.Submit the plaint to the appropriate court having jurisdiction over the matter.The court will issue a summons to the defendantwho must respond within the stipulated time.The court will hear both parties and decide the case based on the evidence presented.'}
{'Instruction': 'What are the common reliefs sought through a public interest litigation (PIL) petition in India?', 'Response': 'Public interest litigation (PIL) petitions in India are typically filed to address issues of public concern or interest. Common reliefs sought through PIL petitions include:Environmental protection and conservation. Government accountability and transparency. Protection of the rights of marginalized or vulnerable groups. Enforcement of laws and regulations for the public welfare. Prevention of human rights violations.'}
{'Instruction': 'Can a plaint be amended after it has been filed in a civil case in India?', 'Response': 'Yesa plaint can be amended in a civil case in India under certain circumstances. The court has the discretion to allow amendments to the plaint to correct defects or add necessary details. Howeverthe court will consider factors like delayprejudice to the other partyand the stage of the proceedings before granting such amendments. It is advisable to seek legal advice before amending a plaint in a civil case.'}
{'Instruction': 'What is a Written Statement in Indian civil procedure?', 'Response': "A Written Statement is a formal legal document filed by the defendant in response to the plaintiff's plaint. It outlines the defendant's version of the eventsdefensesand counterclaims (if any) in a civil lawsuit. It is a critical document as it sets out the defendant's side of the case and helps establish the issues in dispute."}
{'Instruction': 'What is the time limit for filing a Written Statement in India?', 'Response': "As per the Indian rules of civil procedurea defendant must file a Written Statement within 30 days from the date of service of summons or a notice of the suit. If the defendant fails to file the Written Statement within this periodthe court may proceed with the case ex-partemeaning the court will consider only the plaintiff's claims."}
{'Instruction': 'Can a defendant make counterclaims in the Written Statement?', 'Response': "Yes a defendant can make counterclaims in the Written Statement. A counterclaim is a claim made by the defendant against the plaintiffand it arises out of the same transaction or set of facts that form the basis of the plaintiff's claim. Counterclaims can be included in the Written Statement to be adjudicated by the court along with the plaintiff's claims."}
{'Instruction': 'What happens if a defendant fails to file a Written Statement in time?', 'Response': "If a defendant fails to file a Written Statement within the prescribed time limitthe court may proceed with the case ex-parte. This means that the court will consider only the plaintiff's claims and may pass a judgment in favor of the plaintiff based on the evidence presented. Howeverthe defendant can apply to set aside the ex-parte judgment and seek permission to file the Written Statement laterprovided they can provide a valid reason for the delay."}
{'Instruction': 'Can a defendant amend the Written Statement in an ongoing civil case in India?', 'Response': "Yes a defendant can seek permission from the court to amend the Written Statement during the course of the proceedings. Howeversuch amendments are subject to the court's discretionand the court will consider factors like delayprejudice to the other partyand the stage of the proceedings before granting permission. It's advisable to consult with legal counsel before amending a Written Statement in an ongoing civil case."}
{'Instruction': 'What is an affidavit in Indian law?', 'Response': 'An affidavit is a written statement of facts that is sworn or affirmed by the person making it. In Indian lawan affidavit is typically used as evidence in various legal proceedingsincluding civil casescriminal casesand administrative matters. It is a legally binding documentand making false statements in an affidavit can lead to perjury charges.'}
{'Instruction': 'Who can make an affidavit in India?', 'Response': 'Any competent personincluding parties to a casewitnessesor other individuals with relevant informationcan make an affidavit in India. Competence means the person understands the nature and consequences of making a sworn statement. Legal representatives can also prepare affidavits on behalf of their clients.'}
{'Instruction': 'What is the purpose of filing an affidavit in Indian courts?', 'Response': 'Affidavits serve various purposes in Indian courtssuch as: Presenting evidence: Affidavits can be used to present statements of factsespecially when a witness cannot testify in court. Supporting applications: They are often filed in support of applications or petitionsproviding factual information or arguments. Verifying pleadings: In some casesparties are required to file affidavits verifying the truth of their pleadings or claims.'}
{'Instruction': 'Are there specific rules for drafting an affidavit in India?', 'Response': 'Yes there are specific rules for drafting affidavits in India. These rules include: Affidavits must be on non-judicial stamp paper of prescribed valueif applicable. The deponent (person making the affidavit) must sign the affidavit in front of an oath commissionernotary publicor other authorized officials. The affidavit must contain a verification clause where the deponent affirms the truth of the statements made. It should be divided into paragraphseach dealing with a specific fact or statement. It should be clearconciseand free from any irrelevant or extraneous matter.'}
{'Instruction': 'Can affidavits be challenged in Indian courts?', 'Response': "Yes affidavits can be challenged in Indian courts. If a party believes that the contents of an affidavit are false or misleadingthey can file an application to cross-examine the deponent of the affidavit during the trial. Cross-examination allows the challenging party to question the deponent's statements and credibility. Additionallyif it is discovered that a deponent has made false statements in an affidavitthey may be subject to perjury charges."}
{'Instruction': 'What is a notice of motion?', 'Response': 'A notice of motion is an application made in writing to the court requesting judicial orders for specific interim reliefs or directions during the pendency of a case. It can be filed by either the plaintiff/petitioner or defendant/respondent under Order 39 Rule 2 and 3 and Order 43 Rule 1 of the Civil Procedure Code. It is commonly used to seek temporary injunctionsstay orders on earlier decrees or judgmentsearly hearingcondonation of delayproduction of documentsdirections to expedite the caseand other incidental relief while the main case remains pending disposal.'}
{'Instruction': 'What are the contents of a notice of motion?', 'Response': 'A notice of motion sets out clearly the case details and the interim orders sought from the court. It contains the cause title and case numberthe subject matter in briefthe pending proceeding in relation to which relief is soughtspecific order or direction required and the grounds on the basis of which such relief is necessitated. It is supported by an affidavit stating the relevant facts and may have annexures and documents relied upon. The date of hearing when it will be listed before the concerned court is also mentioned.'}
{'Instruction': 'What is the procedure for filing a notice of motion?', 'Response': 'The notice of motion is prepared in the prescribed format and filed before the relevant court along with an affidavit and fees. Copies are provided to the concerned parties. It is listed for hearing on the designated date when the parties appear before the court. The applicant has to provide prior notice regarding the reliefs sought to the respondents. If notice period is waived by the courtthe application may be taken up for immediate hearing. The court considers the urgencynecessity and justification for granting such interim directions.'}
{'Instruction': 'When can a notice of motion be filed?', 'Response': 'A notice of motion for interim directions can be filed at any stage of a pending case when an urgent order is required concerning the matter. It can be filed along with the main suit or at a later date as and when circumstances warrant interim relief. Howeverit must relate to a proceeding already instituted in the court and not an independent action. The courts have the discretion to grantreject or vary the interim order as deemed necessary based on the application.'}
{'Instruction': 'What are the common interim reliefs granted?', 'Response': 'The frequently sought interim reliefs through notice of motion are temporary injunctions to restrain illegal actsappointment of receiversstay orders against execution of decreesexemption from surrendering in criminal casesdirections for expediting the trialmaintenance orders in matrimonial disputes and custody arrangements for minors. Courts can impose conditions while granting interim relief through the notice of motion depending on the facts and urgency shown.'}
{'Instruction': 'What are pleadings in Indian legal proceedings?', 'Response': "Pleadings are formal written statements submitted by the parties involved in a legal case in India. They include the plaintiff's plaint (complaint) and the defendant's written statementwhich together outline the issues in disputethe claimsand the defenses. Pleadings play a crucial role in defining the scope of the case."}
{'Instruction': 'What is the purpose of filing a written statement in pleadings in India?', 'Response': "The written statementfiled by the defendantis a response to the plaintiff's plaint. Its primary purpose is to: Deny or admit the allegations made in the plaint. Raise any legal or factual defenses. Present any counterclaims against the plaintiffif applicable. Through the written statementthe defendant outlines their version of the events and their legal position regarding the case."}
{'Instruction': 'Are there time limits for filing pleadings in India?', 'Response': 'Yes there are time limits for filing pleadings in Indian legal proceedings. Generallya defendant must file the written statement within 30 days from the date of service of summons or notice of the suit. Howeverextensions of time can be granted by the court for valid reasons.'}
{'Instruction': 'Can amendments be made to pleadings in India after they are filed?', 'Response': 'Yes amendments to pleadings can be made in India after they are filedsubject to certain conditions. The court has the discretion to allow amendments to correct defectsadd or strike out partiesor include additional facts. Howeverthe court will consider factors such as delayprejudice to the other partyand the stage of the proceedings before granting permission for amendments.'}
{'Instruction': 'What happens if a party fails to file pleadings in India within the prescribed time?', 'Response': "If a party whether the plaintiff or defendantfails to file the required pleadings within the prescribed time framethe court may take various actionsincluding: Proceeding ex-parte: If the plaintiff fails to file the plaint or the defendant fails to file the written statementthe court may proceed with the case ex-partemeaning it will consider the claims or defenses of the non-defaulting party. Striking off pleadings: In certain casesthe court may strike off the pleadings of the defaulting partyeffectively preventing them from participating further in the case. It's crucial for parties to adhere to the prescribed timelines for filing pleadings to avoid adverse consequences."}
{'Instruction': 'What is a Power of Attorney (POA) in Indian law?', 'Response': 'A Power of Attorney is a legal document that authorizes one person (the principal or donor) to grant legal authority to another person (the attorney-in-fact or agent) to act on their behalf in various legal and financial matters. POAs are commonly used in India for purposes such as property transactionsfinancial managementand legal representation.'}
{'Instruction': 'What are the different types of Power of Attorney in India?', 'Response': 'In India there are primarily two types of Power of Attorney: General Power of Attorney (GPA): This grants broad authority to the agent to act on behalf of the principal in various mattersincluding property transactionsbankingand legal proceedings. Specific Power of Attorney (SPA): This is limited in scope and grants authority for specific actions or transactionssuch as selling a particular property or signing specific documents.'}
{'Instruction': 'Is a Power of Attorney a revocable document in India?', 'Response': 'Yes a Power of Attorney in India is generally revocable. The principal can revoke or cancel the POA at any timeas long as they are mentally competent to do so. Revocation typically requires giving notice to the attorney-in-fact and anyone who may have relied on the POA. Recording the revocation in writing is advisable.'}
{'Instruction': 'Are there specific formalities for executing a Power of Attorney in India?', 'Response': 'Yes there are formalities to be followed when executing a Power of Attorney in Indiaincluding: The POA must be executed on non-judicial stamp paper of the appropriate valueas per the Stamp Act. It must be signed and dated by the principal in the presence of two witnesses. The attorney-in-fact must also sign the document in the presence of the witnesses. Registration of the POA is optional but advisableespecially for property-related matters.'}
{'Instruction': 'Can a Power of Attorney be used for property transactions in India?', 'Response': "Yes a Power of Attorney can be used for property transactions in India. It is a common practice for property owners who are unable to be physically present for a sale or transfer of property to grant a POA to a trusted agent. Howeverit's essential to ensure that the POA is executed and registered correctlyand it should clearly specify the extent of authority granted to the attorney-in-fact for property-related matters."}
{'Instruction': 'What is a Vakalatnama in Indian legal proceedings?', 'Response': 'A Vakalatnama is a formal document that authorizes an advocate or lawyer to act on behalf of a client in a specific case or matter. It is a written authorization given by the client to the advocateallowing the advocate to representpleadand perform legal actions on behalf of the client before the court.'}
{'Instruction': 'What are the key components of a Vakalatnama in India?', 'Response': "A Vakalatnama typically includes the following key components: Details of the clientincluding their name and address. Details of the advocateincluding their nameenrollment numberand address. A clear statement of the court or tribunal before which the advocate is authorized to represent the client. The case number or title of the specific case in which the advocate is appointed. The client's signature or thumb impressionsignifying their consent and authorization."}
{'Instruction': 'Can a Vakalatnama be revoked or withdrawn in India?', 'Response': 'Yesa Vakalatnama can be revoked or withdrawn by the client in India. The client has the right to change their legal representation or withdraw the authorization given to an advocate at any time during the proceedings. This typically requires filing an application or notifying the court and the advocate in writing.'}
{'Instruction': 'Is a Vakalatnama a mandatory requirement for legal representation in Indian courts?', 'Response': 'Yes in most casesa Vakalatnama is a mandatory requirement for legal representation in Indian courts. Advocates can represent clients effectively only after they are authorized through a Vakalatnama. Without a properly executed Vakalatnamaan advocate cannot represent a client in a court proceeding.'}
{'Instruction': 'Can a Vakalatnama be filed electronically or through a Power of Attorney in India?', 'Response': 'In certain casesa Vakalatnama may be filed electronicallydepending on the specific rules and practices of the court. Howeverphysical signatures and thumb impressions of the client are often required to authenticate the document. Additionallya Vakalatnama cannot be substituted by a general Power of Attorney; it is a specialized document for authorizing legal representation in a specific case and must be executed accordingly.'}
{'Instruction': 'What is an application in the context of Indian legal proceedings?', 'Response': 'An application is a formal written request submitted to the court seeking a specific orderreliefor action. Applications are used for various purposes in legal proceedingssuch as interim injunctionsdiscovery of documentsamendment of pleadingsand more. They are essential for advancing a case and addressing specific issues that may arise during litigation.'}
{'Instruction': 'What are some common types of applications filed in Indian courts?', 'Response': "Indian courts receive a wide range of applicationsincluding: Interlocutory Applications: These seek interim relief or specific orders during the pendency of the main casesuch as injunctionsstay ordersor appointment of a receiver. Application for Amendment of Pleadings: Filed to seek permission to modify or amend the original pleadings or written statement to clarifycorrector expand on the case's content. Application for Discovery and Inspection: Filed to request the opposing party to produce certain documents or evidence for examination. Application for Review: Filed to seek a review of a judgment or order passed by a court. Application for Execution: Filed to enforce a decree or order of the courtsuch as for the recovery of money or possession of property."}
{'Instruction': 'What is the process for filing an application in an Indian court?', 'Response': 'The process for filing an application in an Indian court generally involves the following steps: Drafting the application: Prepare a written application that clearly states the request or relief soughtsupported by relevant facts and legal arguments. Payment of court fees: Pay the prescribed court feesif applicablealong with the application. Filing the application: Submit the application to the appropriate court with multiple copies for service on the opposing party and the court. Service of notice: Serve notice of the application to the opposing partyallowing them an opportunity to respond. Hearing: The court schedules a hearing where both parties present their argumentsand the court may pass an appropriate order.'}
{'Instruction': 'Can applications be filed electronically in Indian courts?', 'Response': "Yes many Indian courts have introduced e-filing systems that allow litigants and advocates to file applications electronically. E-filing is becoming increasingly commonespecially in higher courts and metropolitan areas. Howeverthe specific procedures and requirements for e-filing may vary by jurisdictionso it's essential to check the rules of the relevant court."}
{'Instruction': 'What happens if an application is not properly filed or is frivolous in Indian courts?', 'Response': 'If an application is not filed correctlylacks meritor is deemed frivolous by the courtit may be dismissed or rejected. The court may also impose costs or penalties on the party filing the application. It is crucial for applicants to ensure that their applications are legally sound and comply with all procedural requirements to avoid such consequences.'}
{'Instruction': 'What is an Interlocutory Application (IA) in Indian legal proceedings?', 'Response': 'An Interlocutory Application (IA) is a formal application filed by a party to a case during its pendency to request the court to pass specific orders or provide interim relief. These applications are made to address issues that arise between the initiation of the case and its final disposal. IAs are essential for maintaining the balance of justice during ongoing litigation.'}
{'Instruction': 'What are some common types of Interlocutory Applications filed in Indian courts?', 'Response': "Interlocutory Applications can take various formsincluding: Interim Injunctions: Filed to seek a temporary order restraining a party from taking certain actions until the final determination of the case. Stay of Execution: Filed to request a halt on the execution of a decree or order while an appeal is pending. Appointment of a Receiver: Filed to appoint a third-party receiver to preserve or manage property or assets during the case. Amendment of Pleadings: Filed to seek permission to amend the pleadings to clarifycorrector expand on the case's content. Release of Property: Filed to seek the release of seized or attached property during the litigation."}
{'Instruction': 'What is the process for filing an Interlocutory Application in an Indian court?', 'Response': 'The process for filing an Interlocutory Application typically involves the following steps: Drafting the IA: Prepare a written application that clearly states the request for interim relief or specific orderssupported by relevant facts and legal arguments. Payment of court fees: Pay the prescribed court feesif applicablealong with the IA. Filing the IA: Submit the IA to the appropriate court with multiple copies for service on the opposing party and the court. Service of notice: Serve notice of the IA to the opposing partyallowing them an opportunity to respond. Hearing: The court schedules a hearing where both parties present their argumentsand the court may pass an appropriate interim order.'}
{'Instruction': 'Can Interlocutory Applications be filed electronically in Indian courts?', 'Response': "Yesmany Indian courts have introduced e-filing systems that allow litigants and advocates to file Interlocutory Applications electronically. E-filing is becoming increasingly commonespecially in higher courts and metropolitan areas. Howeverthe specific procedures and requirements for e-filing may vary by jurisdictionso it's essential to check the rules of the relevant court."}
{'Instruction': 'Is the decision on an Interlocutory Application finalor can it be challenged?', 'Response': 'The decision on an Interlocutory Application is typically considered an interim order and is subject to review or revision during the course of the case. Parties aggrieved by an interim order may file appeals or revision petitions challenging the decision. The final outcome of the case is determined at the conclusion of the main proceedings.'}
{'Instruction': 'What is First Information Report (FIR)?', 'Response': 'The first information report means an information recorded by a police officer on duty given either by the aggrieved person or any other person to the commission of an alleged offence. On the basis of first information reportthe police commences its investigation.\nSection 154 of the Code of Criminal Procedure1973 defines as to what amounts to first information.'}
{'Instruction': 'Give information on FIR.', 'Response': 'Every information relating to the commission of a cognizable offenceif given orally to an officer-in-charge of a police stationshall be reduced to writing by him or under his directionand be read over to the informant; and every such informationwhether given in writing or reduced to writing as aforesaid shall be signed by the person giving itand the substance thereof shall be entered in a book to be kept by such officer in such form as the State Government may prescribe in this behalf.\nA copy of the information as recorded under sub-section\n(i) shall be given forthwithfree of costto the informant.\nAny person aggrieved by a refusal on the part of an officer-\nin-charge of police station to record the information referred to in sub-section (1) may send the substance of such informationin writing and by post to the Superintendent of Police concernedwho if satisfied that such information discloses the commission of a cognizable offence shall either investigate the case himself or direct an investigation to be made by any police officer subordinate to himin the manner provided by this Codeand such officer shall have all the powers of an officer-in-charge of the police station in relation to that offence.\nThe provision in section 154 regarding the reduction of oral statement to writing and obtaining signature of the informant to itis for the purpose of discouraging irresponsible statement about criminal offences by fixing the informant with the responsibility for the statement he makes.\n\nRefusal by the informant to sign the first information is an offence punishable under section 180 of the Indian Penal Code. The absence of signatures on the first information report by the informanthoweveris not necessary to the extent that it will vitiate and nullify such report. The first information is still admissible in evidence.\n\nIn order to constitute an FIR in terms of section 154 of the Code. of Criminal Procedure1973 two conditions are to be fulfiUed:-\n(a) what is conveyed must be an information; and\n(b) that information should relate to the commission of a cognizable offence on the face of it.\n\nIn other wordsFIR is only a complaint to set the affairs of law and order in motion and it is only at the investigation stage that all the details can be gathered. In one of the judgmentsthe Madhya Pradesh High Court observed that the report of the crime which is persuading the police machinery towards starting investigation is FIRsubsequent reports are/were writtenthey are not hit under section 161 of the Code of Criminal Procedure1973 and cannot be treated as such.'}
{'Instruction': 'Who can File an FIR?', 'Response': 'First Information Report (FIR) can be filed by any person. He need not necessarily be the victim or the injured or an eye-witness. First Information Report may be merely hearsay and need not necessarily be given by the person who has first hand knowledge of the facts.'}
{'Instruction': 'Why FIR should be filed promptly?', 'Response': 'This is the golden principle of law prescribed in the Code of Criminal Procedure1973 that the First Information Report should always be filed promptly and without wasting any time. Such type of report gains the maximum credibility and is always welcome and appreciated by the courts.\n\nAccording to Supreme Court the FIR recorded promptly before the time afforded to embellish or do away with the evidence is useful. It eliminates the possible chance of giving rise to suspicion.'}
{'Instruction': 'Is there time duration fixed for Filing an FIR?', 'Response': 'We have already emphasized this fact that as far as possible and practicableevery FIR should invariably be filed promptlyexpeditiously and without wasting any time. There may be circumstances where some concession of time must be given in filing the FIR But there must be cogent reasons for reasonable delay in filing the FIR under the compelling circumstances. Judges with lot of wisdom and experience can use their discretion judiciously and in the interest of justice in each and every case. Howeverno possible duration of time can be fixed for applying the test of reasonableness to the lodging of an FIR as we have already explained. It depends upon facts and circumstances of each case. The delay in lodging the FIR as such is not fatal in law if the prosecution substantiated the factual difficulties encountered by the persons lodging the report.'}
{'Instruction': 'What are the reports or statements which do not amount to be an FIR?', 'Response': 'Following are the reports or statements which do not amount to be an FIR:\n-A report or a statement recorded after the commencement of the investigation (sections 162 and 163 of the Code of Criminal Procedure1973).\n-Reports not recorded immediately but after questioning of witnesses.\n-Reports recorded after several days of developments.\n-Information not about occurrence of cognizable offence but only cryptic message in the form of an appeal for immediate help.\n-Complaint to the Magistrate.\n-Information to beat house.\n-Information to the Magistrate or police officer on phone.\n-Information received at police station prior to the lodging of an F.LR.'}
{'Instruction': 'What is a court order?', 'Response': 'A court order is a written or oral directive from a judge or court instructing someone to do something or prohibiting some act. Court orders can direct individualsgovernment agenciesorganizationsor corporations to take certain actions. For examplea court order could require someone to appear in courtpay child supportor stop harassing someone. Court orders are legally binding.'}
{'Instruction': 'What is the purpose of a notice of hearing?', 'Response': 'A notice of hearing is a document that informs parties in a case when a court proceeding or hearing is scheduled to take place. Notices of hearing specify the datetimelocation and purpose of the court hearing. They are issued by the court clerk on behalf of the judge. The purpose of a notice of hearing is to give all parties reasonable advanced notice of the hearing so they can prepare and attend. Parties are expected to follow orders in the notice of hearing or risk facing penalties.'}
{'Instruction': 'What are some examples of court orders?', 'Response': 'Some common examples of court orders include:\n\nRestraining orders - These prohibit someone from being near or contacting another person.\nEviction notices - These direct a tenant to vacate a property owned by a landlord.\nArrest warrants - These authorize police to arrest a person suspected of a crime.\nSubpoenas - These compel someone to testify in a trial or provide documents.\nDivorce decrees - These legally dissolve a marriage.\nSearch warrants - These allow police to search and seize property as evidence.\nContempt orders - These punish someone who disobeys a court order.'}
{'Instruction': 'What happens if someone disobeys a court order?', 'Response': "There can be serious consequences for disobeying a court orderincluding:\n\nContempt of court - The judge may issue a contempt of court orderwhich can result in fines or jail time.\nFines - Monetary penalties may be imposed for violating orders.\nArrest and detention - Police can arrest and detain someone for ignoring a court order like an arrest warrant or subpoena.\nLawsuits - The injured party may sue someone who doesn't follow a court order like honoring a contract.\nLoss of the case - Judges can rule against parties who don't follow orders.\nJail time - Continued refusal to comply can result in jail time to coerce compliance."}
{'Instruction': 'How are court orders and notices communicated?', 'Response': "Court orders and notices are formally communicated in various ways:\n\nIn-person announcement - The judge announces the order during court proceedings.\nMail - Documents are mailed to parties' addresses through registered post.\nHand delivery - Court officers like bailiffs may personally deliver orders.\nPublished notice - Orders may be published in approved law journals or newspapers.\nElectronic service - Courts may send notices and orders through emailfax or other digital modes.\nCourt website - Some court orders are uploaded to judicial websites.\nThrough lawyers - Legal counsel may formally receive the order on their client's behalf."}
{'Instruction': 'What is a bail application?', 'Response': 'A bail application is a petition filed by an accused person requesting release from custody during the pendency of legal proceedings. It is filed in the court where the case is pending trial or appeal. The court has discretion to grant or deny bail based on criteria like flight risktampering with evidenceprevious criminal record etc.'}
{'Instruction': 'Who can file for bail?', 'Response': 'A bail application can be filed by the accused person or any person on their behalflike their lawyer or family member. Bail can be sought at various stages like after arrestbefore chargesheet filingduring trialafter conviction prior to appeal etc.'}
{'Instruction': 'What factors does the court consider for bail?', 'Response': 'The court considers factors like:\n\nNature and gravity of the alleged offense\nEvidence against the accused\nBackground and ties to the community\nCriminal record and tendency to commit crimes\nProbability of fleeing the jurisdiction\nPrevious grants or denial of bail\nHealth condition if bail is needed for treatment\nAge and gender of the accused'}
{'Instruction': 'What conditions can be imposed by the court while granting bail?', 'Response': "While granting bailthe court may impose conditions on the accused to ensure appearance in courtlike:\n\nRequiring a bail bond and security deposit\nDirecting periodic appearances before police/court\nSurrendering passport to restrict travel abroad\nAvoiding contact with prosecution witnesses\nAvoiding specific locations like victim's home\nRegular reporting to police station\nWritten undertaking to abide by court orders"}
{'Instruction': 'When can bail be denied?', 'Response': 'Bail may be denied by the courts in cases where:\n\nThe accused can tamper with evidence if released\nThere is high risk of accused fleeing the jurisdiction\nThe accused can influence prosecution witnesses\nPrevious bail has been misused/violated by the accused\nThe accused has been convicted of a heinous crime\nThe court believes release of accused could disturb public order'}
{'Instruction': 'What is a writ petition?', 'Response': 'A writ petition is a formal request filed with a High Court or the Supreme Court under Article 226 or Article 32 of the Constitution of India respectively. The purpose of a writ petition is to seek remedy or relief in case of violation of fundamental rights or breach of statutory provisions. It is an extraordinary recourse available to an aggrieved party when the usual judicial and administrative options are not effective. A writ petition can be filed against the governmentits agencies or public officials requesting them to perform their duties or challenging their unconstitutional actions. The High Court or Supreme Court can issue writs after examining the legality of the issue.'}
{'Instruction': 'What are the different types of writs?', 'Response': 'There are five main types of writs under the Constitution of India that a petitioner can request the High Court or Supreme Court to issue through a writ petition. The first is a Habeas Corpus writ used to produce a person who is illegally detained before the court. The second writ is Mandamus which compels government agencies to perform statutory duties. Third is Prohibition which prohibits unlawful activities by public bodies. The fourth type is Quo Warranto applied to prevent public offices from misuse of power. LastlyCertiorari is used to quash arbitrary orders or judgments and direct certification of records.'}
{'Instruction': 'Who can file a writ petition and against whom?', 'Response': 'A writ petition can be filed by any aggrieved person whose fundamental right has been violated. This includes private individualsorganizationsor even the government itself. It is usually filed against the governmentits departmentspublic officials or statutory bodies that are not performing duties mandated by law or have infringed on constitutionally guaranteed fundamental rights through arbitrary actions. Howevera writ petition cannot be filed against a private party or organization that is not a government agency. The case must involve a substantial public interest question.'}
{'Instruction': 'In which courts can a writ petition be filed?', 'Response': 'In Indiaa writ petition can be filed either with the High Court of the state where the cause of action arises or directly with the Supreme Court. Each High Court holds writ jurisdiction over government agencies and officials located within its territorial jurisdiction. State-specific issues are first heard by respective High Court. The Supreme Court has concurrent original jurisdiction all over India. When substantial national public importance questions are involvedwrit petitions can be directly filed with the Supreme Court.'}
{'Instruction': 'What is the procedure for filing a writ petition?', 'Response': 'The procedure for filing a writ petition involves first sending a notice to concerned authorities regarding the grievance. After giving them reasonable time to responda writ petition can be filed stating the violation of fundamental rights and legal provisions. This is done through an advocate-on-record in the prescribed format along with affidavits and documents supporting the case. The registry will examine the petition and place it before the appropriate High Court Bench or Supreme Court Bench which will hear arguments before passing judgment. Interim orders may be given for immediate relief. The entire process usually takes a few months from start to the final disposal through judgment.'}
{'Instruction': 'What is a review petition?', 'Response': 'A review petition is an application that can be filed by any party to a case requesting the court to review its own final judgment or order. It is filed in the same court that passed the original order or judgment which is sought to be reviewed. The review petition is filed under specific provisions like Order XLVII Rule 1 of Civil Procedure Code or Article 137 of the Constitution of India. The objective is to point out an error or omission in the decision and seek rectification or reversal from the court.'}
{'Instruction': 'What are the grounds on which a review petition can be filed?', 'Response': 'A review petition can be filed only on limited grounds. These grounds include - discovery of new evidence not available during original proceedingsan apparent error on the face of the recordfailure to consider material evidence or documentsor any other sufficient causes like conflicting judgments of the same court. The review petition cannot be filed merely because the petitioner is dissatisfied with the decision or wants reconsideration of the entire case.'}
{'Instruction': 'When can a review petition be filed?', 'Response': 'The Civil Procedure Code sets a limitation period of 30 days for filing a review petition from the date of the original judgmentwhile the Supreme Court Rules stipulate a period of 30 days from the date of order/judgment. In extraordinary casesthe court may condone a delay in filing the review on valid grounds. Howeverthere is no extension to file a review beyond this limitation period. The review petition must indicate the grounds clearly and should be accompanied by supporting documents.'}
{'Instruction': 'How does a court deal with a review petition?', 'Response': 'When a review petition is filedthe court considers it only on the basis of pleadings and documents on record. No fresh evidence can be presented at this stage. If the grounds for review are found unsatisfactorythe court may dismiss the review petition without issuing notice to the opposite party. If a prima facie case for review is made outnotice is issued to the opposite party to seek response. After hearing argumentsthe court may altermodify or reverse the earlier judgment as deemed fit.'}
{'Instruction': 'Is a review petition easily allowed by courts?', 'Response': 'No courts allow review petitions only in rare cases where serious irregularity is shown on the face of the record. The right to file a review is not an inherent right but granted under specific statutes. Mere disagreement with the decision is not adequate grounds for review. The review jurisdiction is exercised sparingly with courts adopting a strict approach while entertaining review petitions. They are not treated as appeals in disguise and cannot be filed repeatedly on the same issue.'}
{'Instruction': 'What is an appeal memorandum?', 'Response': 'An appeal memorandum is a document filed by an aggrieved party before the appellate court to challenge the final judgment or order passed by a lower court in a case. It contains grounds of appeal explaining how the impugned judgment is unsustainable in law and sets out reasons seeking its reversalmodification or remand for fresh consideration. The right to appeal is statutory and appeal memorandum is filed under relevant laws like Section 96 of the Code of Civil Procedure or Section 374 of Code of Criminal Procedure in India.'}
{'Instruction': 'What are the contents of an appeal memorandum?', 'Response': "The appeal memorandum specifies details like cause titlecourt particularscase backgroundsummary of impugned judgmentlegal grounds for appeal with applicable statutes and precedentscertified copy of judgmentprayer seeking reversal or modificationappeal court fees and numbered list of annexures. It frames legal questions on which the appellant seeks the higher court's ruling after pointing out errors in lower court’s decision."}
{'Instruction': 'When can a revision petition be filed?', 'Response': 'A revision petition can be filed under Section 397 of CrPC and Section 115 of CPC before the High Court by any person aggrieved by an order of a lower court. The grounds are illegalityirregularity in procedurefailure of justice or jurisdictional excess. It seeks revision of the lower court’s order but is not an appeal and is filed on comparatively narrower grounds within prescribed limitation period.'}
{'Instruction': 'What are the powers of the appellate court?', 'Response': 'The appellate court exercises statutory powers under civil and criminal procedure codes. It can upholdreversemodify or remand the lower court decision. It can condone delayorder retrialspermit new grounds/evidence or impose costs. Interim orders may be passed for stay on execution of decrees. Final judgment of reversal or modification is passed based on merit after hearing appeal arguments.'}
{'Instruction': 'When can an appeal or revision be dismissed?', 'Response': 'Appeal or revision may be dismissed by appellate court if there are no sufficient groundsdelay in filing is not condonedappeal memorandum is defectiverequired court fees are not paid or statutory limitations are exceeded. Dismissal can also happen if appellant remains absent despite notice. Final lower court order remains in force if appeal/revision is dismissed.'}
{'Instruction': 'What is an execution petition?', 'Response': 'An execution petition is an application filed by a decree holder before the court that passed the decreeseeking enforcement of the judgment whereby money or other relief is granted to the decree holder. It is filed when the judgment debtor fails to voluntarily satisfy the decree within the specified time. The court then initiates the execution process under Order XXI of Civil Procedure Code to recover the decree amount.'}
{'Instruction': 'Who can file an execution petition and when?', 'Response': 'The decree holderon failure of judgment debtor to satisfy the decreecan file the execution petition. It can be filed anytime within 12 years from the date of decree under Section 47 of CPC. Howeverleave of court is required in certain cases. The petition must contain details of the decreethe amount dueprayer for attachment and sale of propertyand applications for civil imprisonmentgarnishee order etc.'}
{'Instruction': 'What does the court do after receiving the execution petition?', 'Response': "The court scrutinizes the petition and can order the judgment debtor to pay within an allocated time. Otherwiseit attaches the judgment debtor's properties that may be sold in public auction to satisfy the decree. Sale proclamation is issued and court can also order arrest and detention in civil prison in case of sums payable under decree. Any objection raised by judgment debtor against execution is decided by the court."}
{'Instruction': 'What modes of execution can the court order?', 'Response': 'The court can order execution by delivery of propertyattachment and sale of movable of immovable propertyarrest and detention in prisonappointment of receiverpayment by installmentsgarnishee orders against third party fundssetting off decretal amountsarrest before judgment etc. as per Code of Civil Procedure provisions.'}
{'Instruction': 'When can the court impose stay or stop execution?', 'Response': 'The court may temporarily stay execution proceedings on grounds of appeal pending against the decreedecree being adjusted in cross claims or fresh suitsthird party claims on attached propertypart payment of decretal amount by judgment debtor or security furnished. Execution can be struck off on grounds like decree being fully satisfied or set aside in appeal. But dismissal does not debar fresh execution petition.'}
{'Instruction': 'What is a judgment?', 'Response': 'A judgmentas defined under Section 2(9) of the Code of Civil Procedureis the final decision or determination of a court on the issues framed and raised between the parties to a suit. It concludes the trial proceedings and decides on the case based on applicable laws to the facts presented before the court. It encompasses reasons and grounds for the decision on each issue. It is the end product of the adjudication process settling the dispute between the parties.'}
{'Instruction': 'What are the contents of a judgment?', 'Response': "The contents of a judgment include case detailssummary of pleadings by both sidesframing of point-wise issuesevidence analysisapplicable legal provisionsprevious case laws relied uponreasoning and conclusions on each issueoperative part containing the final decision and reliefs grantedimposition of costs if anydatejudge's signature and court seal. Minor corrections are permissible."}
{'Instruction': 'What is a decree? How is it different from judgment?', 'Response': 'A decreeas per Section 2(2) of the CPCis the formal expression of the adjudication. It contains the operative part of the judgmentstating rights and liabilities of parties as determined by the court. It lays down the remedy granted by the court to the successful party. While judgment is detailed reasonsa decree briefly states the final reliefs. Decree can be preliminary or final. Appeal is filed against decree.'}
{'Instruction': 'What are the different kinds of decrees?', 'Response': 'Decrees can be preliminaryfinalor executable. Preliminary decree declares rights of parties leaving further proceedings for future. Final decree completes the suit. Partly preliminary and partly final decrees are also possible. An executable decree can be directly enforced and executed by the beneficiary. Conditional decrees impose certain conditions.'}
{'Instruction': 'When does a judgment and decree come into effect?', 'Response': 'The judgment and decree come into legal effect on the date when it is pronounced in open court. Howevera written judgment with decree signed by the judge is the authoritative document. The decree holder can proceed to execute it only after the period for appeal lapses or if appeal fails. A preliminary decree requires drawing up of a final decree for enforcement. Injunction decrees can be implemented immediately.'}
{'Instruction': 'What is cross-examination of witnesses?', 'Response': 'Cross-examination refers to the questioning and interrogation of a witness presented by one partyby the opposing party during a trial. It is governed by Section 137 of the Indian Evidence Act1872. Its objective is to test the veracity and reliability of the witness testimony presented during examination-in-chief by bringing out contradictionscasting doubts or weakening the case. Leading questions can be put challenging the witness’s memoryfacts stated and credibility'}
{'Instruction': 'What is the scope of cross-examination?', 'Response': 'The scope of cross-examination is limited to the facts stated by the witness during examination-in-chief. It cannot travel beyond these facts. Questions must pertain to relevant facts and not be offensive or annoying. Howeverthe cross-examiner has latitude regarding nature and type of questionsincluding leading questionsto scrutinize the accuracy and truthfulness of evidence. The court has discretion to control the questioning.'}
{'Instruction': 'When does re-examination arise?', 'Response': 'Re-examination of a witness is undertaken as per Section 138 of Indian Evidence Act after the cross-examination is over. The party that produced the witness can question the witness again to explain any clarifications regarding new facts introduced during cross-examination. Any damage to the nature of evidence can be rebutted at this stage. But no new matter can be introduced.'}
{'Instruction': 'What are the rights and duties during cross-examination?', 'Response': "The cross-examiner has the right to compel a witness to answer questions with court's permission. Leading questions can be asked. The witness is bound to answer truthfully all questions within her knowledge. The court can intervene to protect the witness from harassmentinappropriate questions or to expedite proceedings. The witness can refuse to answer incriminating questions."}
{'Instruction': 'Why is cross-examination important?', 'Response': 'Cross-examination is vital to the adversarial legal system. It tests the reliability of witnesses and brings out the truth. It gives opportunity to shake the credit of the adversary’s witness. Vague statements can be probed further to ascertain facts accurately. Any exaggerations or inaccuracies in examination-in-chief testimony can be highlighted. It helps establish contradictions to aid the court reach correct conclusions.'}
{'Instruction': 'What is a list of witnesses?', 'Response': 'A list of witnesses is a document furnished by both parties to a suit detailing the namesaddresses and occupations of persons they propose to examine as witnesses during trial. It is mandatory to exchange witness lists as per Order XVI Rule 1 of Civil Procedure Code between parties and submit to court. This helps avoid surprises and enables cross-examination preparation. Courts can suo moto summon important witnesses not listed by parties.'}
{'Instruction': 'When must the list of witnesses be submitted?', 'Response': "In civil suitsthe plaintiff's list of witnesses must be submitted at the time of filing the suit or within 15 days after an appearance by the defendant. The defendant's list is filed within 15 days after submission of the plaintiff's list. In criminal trialsprosecution must give its list after the accused's appearance while defense lists out witnesses after prosecution evidence ends. Courts can set specific deadlines."}
{'Instruction': 'What happens if a witness list is not filed?', 'Response': 'If a party does not submit the list of witnessesthen as per Order XVI Rule 1 of CPCno evidence shall be recorded of witnesses not mentioned in the list. Howeverexemption may be allowed if sufficient cause is shown like witnesses becoming suddenly available. Courts have discretion to allow unlisted witnesses to ensure fair and proper trial.'}
{'Instruction': 'What is examination-in-chief?', 'Response': 'Examination-in-chief refers to the first stage of leading questions put to a witness by the party who calls the witnessto bring out the desired facts to establish its case. It is governed by the Indian Evidence Act1872. Leading questions are permissible at this stage. It helps bring out the witness’ account of relevant events before testing by opposite party.'}
{'Instruction': 'What matters are covered in examination-in-chief?', 'Response': "The examination-in-chief covers introduction of the witnessevents with firsthand knowledge relevant to the suitdocuments relied uponexamination of exhibitsclarifying pleadings through witness account and all facts required to prove the examiner's case. Hypothetical questions may also be asked. The court controls excessive or irrelevant questioning and can re-examine the witness."}
{'Instruction': 'Article 0 of Indian Constitution', 'Response': 'Preamble: We, the people of india, having solemnly resolved to constitute india into a sovereign socialist secular democratic republic and to secure to all its citizens: justice, social, economic and political; liberty of thought, expression, belief, faith and worship; equality of status and of opportunity; and to promote among them all fraternity assuring the dignity of the individual and the unity and integrity of the nation; in our constituent assembly this twenty-sixth day of november, 1949, do hereby adopt, enact and give to ourselves this constitution"\nArticle 1 of Indian Constitution,"Name and territory of the Union\n(1) India, that is Bharat, shall be a Union of States\n(2) The States and the territories thereof shall be as specified in the First Schedule\n(3) The territory of India shall comprise\nThe territories of the States; the Union territories specified in the First Schedule; and such other territories as may be acquired","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 1 of Indian Constitution', 'Response': 'Name and territory of the Union\n(1) India, that is Bharat, shall be a Union of States\n(2) The States and the territories thereof shall be as specified in the First Schedule\n(3) The territory of India shall comprise\nThe territories of the States; the Union territories specified in the First Schedule; and such other territories as may be acquired"\nArticle 2 of Indian Constitution,"Admission or establishment of new States: Parliament may by law admit into the Union, or establish, new States on such terms and conditions, as it thinks fit","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 2 of Indian Constitution', 'Response': 'Admission or establishment of new States: Parliament may by law admit into the Union, or establish, new States on such terms and conditions, as it thinks fit"\nArticle 2A of Indian Constitution,"Sikkim to be associated with the Union Rep by the Constitution Thirty six Amendment Act, 1975 , Section 5 (w e f 26 04 1975 )","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 2A of Indian Constitution', 'Response': 'Sikkim to be associated with the Union Rep by the Constitution Thirty six Amendment Act, 1975 , Section 5 (w e f 26 04 1975 )"\nArticle 3 of Indian Constitution,"Formation of new States and alteration of areas, boundaries or names of existing States: Parliament may by law\n(a) form a new State by separation of territory from any State or by uniting two or more States or parts of States or by uniting any territory to a part of any State;\n(b) increase the area of any State;\n(c) diminish the area of any State;\n(d) alter the boundaries of any State;\n(e) alter the name of any State; Provided that no Bill for the purpose shall be introduced in either House of Parliament except on the recommendation of the President and unless, where the proposal contained in the Bill affects the area, boundaries or name of any of the States, the Bill has been referred by the President to the Legislature of that State for expressing its views thereon within such period as may be specified in the reference or within such further period as the President may allow and the period so specified or allowed has expired Explanation I In this article, in clauses (a) to (e), State includes a Union territory, but in the proviso, State does not include a Union territory Explanation II The power conferred on Parliament by clause (a) includes the power to form a new State or Union territory by uniting a part of any State or Union territory to any other State or Union territory","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 3 of Indian Constitution', 'Response': 'Formation of new States and alteration of areas, boundaries or names of existing States: Parliament may by law\n(a) form a new State by separation of territory from any State or by uniting two or more States or parts of States or by uniting any territory to a part of any State;\n(b) increase the area of any State;\n(c) diminish the area of any State;\n(d) alter the boundaries of any State;\n(e) alter the name of any State; Provided that no Bill for the purpose shall be introduced in either House of Parliament except on the recommendation of the President and unless, where the proposal contained in the Bill affects the area, boundaries or name of any of the States, the Bill has been referred by the President to the Legislature of that State for expressing its views thereon within such period as may be specified in the reference or within such further period as the President may allow and the period so specified or allowed has expired Explanation I In this article, in clauses (a) to (e), State includes a Union territory, but in the proviso, State does not include a Union territory Explanation II The power conferred on Parliament by clause (a) includes the power to form a new State or Union territory by uniting a part of any State or Union territory to any other State or Union territory"\nArticle 4 of Indian Constitution,"Laws made under Articles 2 and 3 to provide for the amendment of the First and the Fourth Schedules and supplemental, incidental and consequential matters\n(1) Any law referred to in Article 2 or Article 3 shall contain such provisions for the amendment of the First Schedule and the Fourth Schedule as may be necessary to give effect to the provisions of the law and may also contain such supplemental, incidental and consequential provisions (including provisions as to representation in Parliament and in the Legislature or Legislatures of the State or States affected by such law) as Parliament may deem necessary\n(2) No such law as aforesaid shall be deemed to be an amendment of this Constitution for the purposes of Article 368 PART II C ITIZENSHIP","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 4 of Indian Constitution', 'Response': 'Laws made under Articles 2 and 3 to provide for the amendment of the First and the Fourth Schedules and supplemental, incidental and consequential matters\n(1) Any law referred to in Article 2 or Article 3 shall contain such provisions for the amendment of the First Schedule and the Fourth Schedule as may be necessary to give effect to the provisions of the law and may also contain such supplemental, incidental and consequential provisions (including provisions as to representation in Parliament and in the Legislature or Legislatures of the State or States affected by such law) as Parliament may deem necessary\n(2) No such law as aforesaid shall be deemed to be an amendment of this Constitution for the purposes of Article 368 PART II C ITIZENSHIP"\nArticle 5 of Indian Constitution,"Citizenship at the commencement of the Constitution At the commencement of this Constitution every person who has his domicile in the territory of India and\n(a) who was born in the territory of India; or\n(b) either of whose parents was born in the territory of India; or\n(c) who has been ordinarily resident in the territory of India for not less than five years preceding such commencement, shall be a citizen of India","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 5 of Indian Constitution', 'Response': 'Citizenship at the commencement of the Constitution At the commencement of this Constitution every person who has his domicile in the territory of India and\n(a) who was born in the territory of India; or\n(b) either of whose parents was born in the territory of India; or\n(c) who has been ordinarily resident in the territory of India for not less than five years preceding such commencement, shall be a citizen of India"\nArticle 6 of Indian Constitution,"Rights of citizenship of certain persons who have migrated to India from Pakistan Notwithstanding anything in Article 5, a person who has migrated to the territory of India from the territory now included in Pakistan shall be deemed to be a citizen of India at the commencement of this Constitution if\n(a) he or either of his parents or any of his grand parents was born in India as defined in the Government of India Act, 1935 (as originally enacted); and\n(b)\n(i) in the case where such person has so migrated before the nineteenth day of July, 1948 , he has been ordinarily resident in the territory of India since the date of his migration, or\n(ii) in the case where such person has so migrated on or after the nineteenth day of July, 1948 , he has been registered as a citizen of India by an officer appointed in that behalf by the Government of the Dominion of India on an application made by him therefor to such officer before the commencement of this Constitution in the form and manner prescribed by that Government: Provided that no person shall be so registered unless he has been resident in the territory of India or at least six months immediately preceding the date of his application","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 6 of Indian Constitution', 'Response': 'Rights of citizenship of certain persons who have migrated to India from Pakistan Notwithstanding anything in Article 5, a person who has migrated to the territory of India from the territory now included in Pakistan shall be deemed to be a citizen of India at the commencement of this Constitution if\n(a) he or either of his parents or any of his grand parents was born in India as defined in the Government of India Act, 1935 (as originally enacted); and\n(b)\n(i) in the case where such person has so migrated before the nineteenth day of July, 1948 , he has been ordinarily resident in the territory of India since the date of his migration, or\n(ii) in the case where such person has so migrated on or after the nineteenth day of July, 1948 , he has been registered as a citizen of India by an officer appointed in that behalf by the Government of the Dominion of India on an application made by him therefor to such officer before the commencement of this Constitution in the form and manner prescribed by that Government: Provided that no person shall be so registered unless he has been resident in the territory of India or at least six months immediately preceding the date of his application"\nArticle 7 of Indian Constitution,"Rights of citizenship of certain migrants to Pakistan Notwithstanding anything in Articles 5 and 6, a person who has after the first day of March, 1947 , migrated from the territory of India to the territory now included in Pakistan shall not be deemed to be a citizen of India: Provided that nothing in this article shall apply to a person who, after having so migrated to the territory now included in Pakistan, has returned to the territory of India under a permit for resettlement or permanent return issued by or under the authority of any law and every such person shall for the purposes of clause (b) of Article 6 be deemed to have migrated to the territory of India after the nineteenth day of July, 1948","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 7 of Indian Constitution', 'Response': 'Rights of citizenship of certain migrants to Pakistan Notwithstanding anything in Articles 5 and 6, a person who has after the first day of March, 1947 , migrated from the territory of India to the territory now included in Pakistan shall not be deemed to be a citizen of India: Provided that nothing in this article shall apply to a person who, after having so migrated to the territory now included in Pakistan, has returned to the territory of India under a permit for resettlement or permanent return issued by or under the authority of any law and every such person shall for the purposes of clause (b) of Article 6 be deemed to have migrated to the territory of India after the nineteenth day of July, 1948"\nArticle 8 of Indian Constitution,"Rights of citizenship of certain persons of India origin residing outside India Notwithstanding anything in Article 5, any person who or either of whose parents or any of whose grand parents was born in India as defined in the Government of India Act, 1935 (as originally enacted), and who is ordinarily residing in any country outside India as so defined shall be deemed to be a citizen of India if he has been registered as a citizen of India by the diplomatic or consular representative of India in the country where he is for the time being residing on an application made by him therefor to such diplomatic or consular representative, whether before or after the commencement of this Constitution, in the form and manner prescribed by the Government of the Dominion of India or the Government of India","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 8 of Indian Constitution', 'Response': 'Rights of citizenship of certain persons of India origin residing outside India Notwithstanding anything in Article 5, any person who or either of whose parents or any of whose grand parents was born in India as defined in the Government of India Act, 1935 (as originally enacted), and who is ordinarily residing in any country outside India as so defined shall be deemed to be a citizen of India if he has been registered as a citizen of India by the diplomatic or consular representative of India in the country where he is for the time being residing on an application made by him therefor to such diplomatic or consular representative, whether before or after the commencement of this Constitution, in the form and manner prescribed by the Government of the Dominion of India or the Government of India"\nArticle 9 of Indian Constitution,"Person voluntarily acquiring citizenship of a foreign State not to be citizens No person shall be a citizen of India by virtue of Article 5, or be deemed to be a citizen of India by virtue of Article 6 or Article 8, if he has voluntarily acquired the citizenship of any foreign State","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 9 of Indian Constitution', 'Response': 'Person voluntarily acquiring citizenship of a foreign State not to be citizens No person shall be a citizen of India by virtue of Article 5, or be deemed to be a citizen of India by virtue of Article 6 or Article 8, if he has voluntarily acquired the citizenship of any foreign State"\nArticle 10 of Indian Constitution,"Continuance of the rights of citizenship Every person who is or is deemed to be a citizen of India under any of the foregoing provisions of this Part shall, subject to the provisions of any law that may be made by Parliament, continue to be such citizen","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 10 of Indian Constitution', 'Response': 'Continuance of the rights of citizenship Every person who is or is deemed to be a citizen of India under any of the foregoing provisions of this Part shall, subject to the provisions of any law that may be made by Parliament, continue to be such citizen"\nArticle 11 of Indian Constitution,Parliament to regulate the right of citizenship by law Nothing in the foregoing provisions of this Part shall derogate from the power of Parliament to make any provision with respect to the acquisition and termination of citizenship and all other matters relating to citizenship PART III FUNDAMENTAL RIGHTS General,"Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 11 of Indian Constitution', 'Response': 'Parliament to regulate the right of citizenship by law Nothing in the foregoing provisions of this Part shall derogate from the power of Parliament to make any provision with respect to the acquisition and termination of citizenship and all other matters relating to citizenship PART III FUNDAMENTAL RIGHTS General"\nArticle 12 of Indian Constitution,"Definition In this part, unless the context otherwise requires, the State includes the Government and Parliament of India and the Government and the Legislature of each of the States and all local or other authorities within the territory of India or under the control of the Government of India","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 12 of Indian Constitution', 'Response': 'Definition In this part, unless the context otherwise requires, the State includes the Government and Parliament of India and the Government and the Legislature of each of the States and all local or other authorities within the territory of India or under the control of the Government of India"\nArticle 13 of Indian Constitution,"Laws inconsistent with or in derogation of the fundamental rights\n(1) All laws in force in the territory of India immediately before the commencement of this Constitution, in so far as they are inconsistent with the provisions of this Part, shall, to the extent of such inconsistency, be void\n(2) The State shall not make any law which takes away or abridges the rights conferred by this Part and any law made in contravention of this clause shall, to the extent of the contravention, be void\n(3) In this article, unless the context otherwise requires law includes any Ordinance, order, bye law, rule, regulation, notification, custom or usages having in the territory of India the force of law; laws in force includes laws passed or made by Legislature or other competent authority in the territory of India before the commencement of this Constitution and not previously repealed, notwithstanding that any such law or any part thereof may not be then in operation either at all or in particular areas\n(4) Nothing in this article shall apply to any amendment of this Constitution made under Article 368 Right of Equality","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 13 of Indian Constitution', 'Response': 'Laws inconsistent with or in derogation of the fundamental rights\n(1) All laws in force in the territory of India immediately before the commencement of this Constitution, in so far as they are inconsistent with the provisions of this Part, shall, to the extent of such inconsistency, be void\n(2) The State shall not make any law which takes away or abridges the rights conferred by this Part and any law made in contravention of this clause shall, to the extent of the contravention, be void\n(3) In this article, unless the context otherwise requires law includes any Ordinance, order, bye law, rule, regulation, notification, custom or usages having in the territory of India the force of law; laws in force includes laws passed or made by Legislature or other competent authority in the territory of India before the commencement of this Constitution and not previously repealed, notwithstanding that any such law or any part thereof may not be then in operation either at all or in particular areas\n(4) Nothing in this article shall apply to any amendment of this Constitution made under Article 368 Right of Equality"\nArticle 14 of Indian Constitution,"Equality before law The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 14 of Indian Constitution', 'Response': 'Equality before law The State shall not deny to any person equality before the law or the equal protection of the laws within the territory of India Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth"\nArticle 15 of Indian Constitution,"Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth\n(1) The State shall not discriminate against any citizen on grounds only of religion, race, caste, sex, place of birth or any of them\n(2) No citizen shall, on grounds only of religion, race, caste, sex, place of birth or any of them, be subject to any disability, liability, restriction or condition with regard to\n(a) access to shops, public restaurants, hotels and palaces of public entertainment; or\n(b) the use of wells, tanks, bathing ghats, roads and places of public resort maintained wholly or partly out of State funds or dedicated to the use of the general public\n(3) Nothing in this article shall prevent the State from making any special provision for women and children\n(4) Nothing in this article or in clause ( 2 ) of Article 29 shall prevent the State from making any special provision for the advancement of any socially and educationally backward classes of citizens or for the Scheduled Castes and the Scheduled Tribes","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 15 of Indian Constitution', 'Response': 'Prohibition of discrimination on grounds of religion, race, caste, sex or place of birth\n(1) The State shall not discriminate against any citizen on grounds only of religion, race, caste, sex, place of birth or any of them\n(2) No citizen shall, on grounds only of religion, race, caste, sex, place of birth or any of them, be subject to any disability, liability, restriction or condition with regard to\n(a) access to shops, public restaurants, hotels and palaces of public entertainment; or\n(b) the use of wells, tanks, bathing ghats, roads and places of public resort maintained wholly or partly out of State funds or dedicated to the use of the general public\n(3) Nothing in this article shall prevent the State from making any special provision for women and children\n(4) Nothing in this article or in clause ( 2 ) of Article 29 shall prevent the State from making any special provision for the advancement of any socially and educationally backward classes of citizens or for the Scheduled Castes and the Scheduled Tribes"\nArticle 16 of Indian Constitution,"Equality of opportunity in matters of public employment\n(1) There shall be equality of opportunity for all citizens in matters relating to employment or appointment to any office under the State\n(2) No citizen shall, on grounds only of religion, race, caste, sex, descent, place of birth, residence or any of them, be ineligible for, or discriminated against in respect or, any employment or office under the State\n(3) Nothing in this article shall prevent Parliament from making any law prescribing, in regard to a class or classes of employment or appointment to an office under the Government of, or any local or other authority within, a State or Union territory, any requirement as to residence within that State or Union territory prior to such employment or appointment\n(4) Nothing in this article shall prevent the State from making any provision for the reservation of appointments or posts in favor of any backward class of citizens which, in the opinion of the State, is not adequately represented in the services under the State\n(5) Nothing in this article shall affect the operation of any law which provides that the incumbent of an office in connection with the affairs of any religious or denominational institution or any member of the governing body thereof shall be a person professing a particular religion or belonging to a particular denomination","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 16 of Indian Constitution', 'Response': 'Equality of opportunity in matters of public employment\n(1) There shall be equality of opportunity for all citizens in matters relating to employment or appointment to any office under the State\n(2) No citizen shall, on grounds only of religion, race, caste, sex, descent, place of birth, residence or any of them, be ineligible for, or discriminated against in respect or, any employment or office under the State\n(3) Nothing in this article shall prevent Parliament from making any law prescribing, in regard to a class or classes of employment or appointment to an office under the Government of, or any local or other authority within, a State or Union territory, any requirement as to residence within that State or Union territory prior to such employment or appointment\n(4) Nothing in this article shall prevent the State from making any provision for the reservation of appointments or posts in favor of any backward class of citizens which, in the opinion of the State, is not adequately represented in the services under the State\n(5) Nothing in this article shall affect the operation of any law which provides that the incumbent of an office in connection with the affairs of any religious or denominational institution or any member of the governing body thereof shall be a person professing a particular religion or belonging to a particular denomination"\nArticle 17 of Indian Constitution,Abolition of Untouchability Untouchability is abolished and its practice in any form is forbidden The enforcement of any disability arising out of Untouchability shall be an offence punishable in accordance with law,"Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 17 of Indian Constitution', 'Response': 'Abolition of Untouchability Untouchability is abolished and its practice in any form is forbidden The enforcement of any disability arising out of Untouchability shall be an offence punishable in accordance with law"\nArticle 18 of Indian Constitution,"Abolition of titles No title, not being a military or academic distinction, shall be conferred by the State No citizen of India shall accept any title from any foreign State No person who is not a citizen of India shall, while he holds any office of profit or trust under the State, accept without the consent of the President any title from any foreign State No person holding any office of profit or trust under the State shall, without the consent of the President, accept any present, emolument, or office of any kind from or under any foreign State Right to Freedom","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 18 of Indian Constitution', 'Response': 'Abolition of titles No title, not being a military or academic distinction, shall be conferred by the State No citizen of India shall accept any title from any foreign State No person who is not a citizen of India shall, while he holds any office of profit or trust under the State, accept without the consent of the President any title from any foreign State No person holding any office of profit or trust under the State shall, without the consent of the President, accept any present, emolument, or office of any kind from or under any foreign State Right to Freedom"\nArticle 19 of Indian Constitution,"Protection of certain rights regarding freedom of speech etc\n(1) All citizens shall have the right\n(a) to freedom of speech and expression;\n(b) to assemble peaceably and without arms;\n(c) to form associations or unions;\n(d) to move freely throughout the territory of India;\n(e) to reside and settle in any part of the territory of India; and\n(f) omitted\n(g) to practise any profession, or to carry on any occupation, trade or business\n(2) Nothing in sub clause (a) of clause ( 1 ) shall affect the operation of any existing law, or prevent the State from making any law, in so far as such law imposes reasonable restrictions on the exercise of the right conferred by the said sub clause in the interests of the sovereignty and integrity of India, the security of the State, friendly relations with foreign States, public order, decency or morality or in relation to contempt of court, defamation or incitement to an offence\n(3) Nothing in sub clause (b) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests of the sovereignty and integrity of India or public order, reasonable restrictions on the exercise of the right conferred by the said sub clause\n(4) Nothing in sub clause (c) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests of the sovereignty and integrity of India or public order or morality, reasonable restrictions on the exercise of the right conferred by the said sub clause\n(5) Nothing in sub clauses (d) and (e) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, reasonable restrictions on the exercise of any of the rights conferred by the said sub clauses either in the interests of the general public or for the protection of the interests of any Scheduled Tribe\n(6) Nothing in sub clause (g) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests of the general public, reasonable restrictions on the exercise of the right conferred by the said sub clause, and, in particular, nothing in the said sub clause shall affect the operation of any existing law in so far as it relates to, or prevent the State from making any law relating to,\n(i) the professional or technical qualifications necessary for practising any profession or carrying on any occupation, trade or business, or\n(ii) the carrying on by the State, or by a corporation owned or controlled by the State, of any trade, business, industry or service, whether to the exclusion, complete or partial, of citizens or otherwise","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 19 of Indian Constitution', 'Response': 'Protection of certain rights regarding freedom of speech etc\n(1) All citizens shall have the right\n(a) to freedom of speech and expression;\n(b) to assemble peaceably and without arms;\n(c) to form associations or unions;\n(d) to move freely throughout the territory of India;\n(e) to reside and settle in any part of the territory of India; and\n(f) omitted\n(g) to practise any profession, or to carry on any occupation, trade or business\n(2) Nothing in sub clause (a) of clause ( 1 ) shall affect the operation of any existing law, or prevent the State from making any law, in so far as such law imposes reasonable restrictions on the exercise of the right conferred by the said sub clause in the interests of the sovereignty and integrity of India, the security of the State, friendly relations with foreign States, public order, decency or morality or in relation to contempt of court, defamation or incitement to an offence\n(3) Nothing in sub clause (b) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests of the sovereignty and integrity of India or public order, reasonable restrictions on the exercise of the right conferred by the said sub clause\n(4) Nothing in sub clause (c) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests of the sovereignty and integrity of India or public order or morality, reasonable restrictions on the exercise of the right conferred by the said sub clause\n(5) Nothing in sub clauses (d) and (e) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, reasonable restrictions on the exercise of any of the rights conferred by the said sub clauses either in the interests of the general public or for the protection of the interests of any Scheduled Tribe\n(6) Nothing in sub clause (g) of the said clause shall affect the operation of any existing law in so far as it imposes, or prevent the State from making any law imposing, in the interests of the general public, reasonable restrictions on the exercise of the right conferred by the said sub clause, and, in particular, nothing in the said sub clause shall affect the operation of any existing law in so far as it relates to, or prevent the State from making any law relating to,\n(i) the professional or technical qualifications necessary for practising any profession or carrying on any occupation, trade or business, or\n(ii) the carrying on by the State, or by a corporation owned or controlled by the State, of any trade, business, industry or service, whether to the exclusion, complete or partial, of citizens or otherwise"\nArticle 20 of Indian Constitution,"Protection in respect of conviction for offences\n(1) No person shall be convicted of any offence except for violation of the law in force at the time of the commission of the act charged as an offence, nor be subjected to a penalty greater than that which might have been inflicted under the law in force at the time of the commission of the offence\n(2) No person shall be prosecuted and punished for the same offence more than once\n(3) No person accused of any offence shall be compelled to be a witness against himself","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 20 of Indian Constitution', 'Response': 'Protection in respect of conviction for offences\n(1) No person shall be convicted of any offence except for violation of the law in force at the time of the commission of the act charged as an offence, nor be subjected to a penalty greater than that which might have been inflicted under the law in force at the time of the commission of the offence\n(2) No person shall be prosecuted and punished for the same offence more than once\n(3) No person accused of any offence shall be compelled to be a witness against himself"\nArticle 21 of Indian Constitution,Protection of life and personal liberty No person shall be deprived of his life or personal liberty except according to procedure established by law,"Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 21 of Indian Constitution', 'Response': 'Protection of life and personal liberty No person shall be deprived of his life or personal liberty except according to procedure established by law"\nArticle 22 of Indian Constitution,"Protection against arrest and detention in certain cases\n(1) No person who is arrested shall be detained in custody without being informed, as soon as may be, of the grounds for such arrest nor shall he be denied the right to consult, and to be defended by, a legal practitioner of his choice\n(2) Every person who is arrested and detained in custody shall be produced before the nearest magistrate within a period of twenty four hours of such arrest excluding the time necessary for the journey from the place of arrest to the court of the magistrate and no such person shall be detained in custody beyond the said period without the authority of a magistrate\n(3) Nothing in clauses ( 1 ) and ( 2 ) shall apply (a) to any person who for the time being is an enemy alien; or (b) to any person who is arrested or detained under any law providing for preventive detention\n(4) No law providing for preventive detention shall authorise the detention of a person for a longer period than three months unless (a) an Advisory Board consisting of persons who are, or have been, or are qualified to be appointed as, Judges of a High Court has reported before the expiration of the said period of three months that there is in its opinion sufficient cause for such detention:\n(5) When any person is detained in pursuance of an order made under any law providing for preventive detention, the authority making the order shall, as soon as may be, communicate to such person the grounds on which the order has been made and shall afford him the earliest opportunity of making a representation against the order\n(6) Nothing in clause ( 5 ) shall require the authority making any such order as is referred to in that clause to disclose facts which such authority considers to be against the public interest to disclose\n(7) Parliament may by law prescribe\n(a) the circumstances under which, and the class or classes of cases in which, a person may be detained for a period longer than three months under any law providing for preventive detention without obtaining the opinion of an Advisory Board in accordance with the provisions of sub clause (a) of clause ( 4 );\n(b) the maximum period for which any person may in any class or classes of cases be detained under any law providing for preventive detention; and\n(c) the procedure to be followed by an Advisory Board in an inquiry under sub clause (a) of clause ( 4 ) Right against Exploitation","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 22 of Indian Constitution', 'Response': 'Protection against arrest and detention in certain cases\n(1) No person who is arrested shall be detained in custody without being informed, as soon as may be, of the grounds for such arrest nor shall he be denied the right to consult, and to be defended by, a legal practitioner of his choice\n(2) Every person who is arrested and detained in custody shall be produced before the nearest magistrate within a period of twenty four hours of such arrest excluding the time necessary for the journey from the place of arrest to the court of the magistrate and no such person shall be detained in custody beyond the said period without the authority of a magistrate\n(3) Nothing in clauses ( 1 ) and ( 2 ) shall apply (a) to any person who for the time being is an enemy alien; or (b) to any person who is arrested or detained under any law providing for preventive detention\n(4) No law providing for preventive detention shall authorise the detention of a person for a longer period than three months unless (a) an Advisory Board consisting of persons who are, or have been, or are qualified to be appointed as, Judges of a High Court has reported before the expiration of the said period of three months that there is in its opinion sufficient cause for such detention:\n(5) When any person is detained in pursuance of an order made under any law providing for preventive detention, the authority making the order shall, as soon as may be, communicate to such person the grounds on which the order has been made and shall afford him the earliest opportunity of making a representation against the order\n(6) Nothing in clause ( 5 ) shall require the authority making any such order as is referred to in that clause to disclose facts which such authority considers to be against the public interest to disclose\n(7) Parliament may by law prescribe\n(a) the circumstances under which, and the class or classes of cases in which, a person may be detained for a period longer than three months under any law providing for preventive detention without obtaining the opinion of an Advisory Board in accordance with the provisions of sub clause (a) of clause ( 4 );\n(b) the maximum period for which any person may in any class or classes of cases be detained under any law providing for preventive detention; and\n(c) the procedure to be followed by an Advisory Board in an inquiry under sub clause (a) of clause ( 4 ) Right against Exploitation"\nArticle 23 of Indian Constitution,"Prohibition of traffic in human beings and forced labour\n(1) Traffic in human beings and begar and other similar forms of forced labour are prohibited and any contravention of this provision shall be an offence punishable in accordance with law\n(2) Nothing in this article shall prevent the State from imposing compulsory service for public purpose, and in imposing such service the State shall not make any discrimination on grounds only of religion, race, caste or class or any of them","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 23 of Indian Constitution', 'Response': 'Prohibition of traffic in human beings and forced labour\n(1) Traffic in human beings and begar and other similar forms of forced labour are prohibited and any contravention of this provision shall be an offence punishable in accordance with law\n(2) Nothing in this article shall prevent the State from imposing compulsory service for public purpose, and in imposing such service the State shall not make any discrimination on grounds only of religion, race, caste or class or any of them"\nArticle 24 of Indian Constitution,"Prohibition of employment of children in factories, etc No child below the age of fourteen years shall be employed to work in any factory or mine or engaged in any other hazardous employment Provided that nothing in this sub clause shall authorise the detention of any person beyond the maximum period prescribed by any law made by Parliament under sub clause (b) of clause ( 7 ); or such person is detained in accordance with the provisions of any law made by Parliament under sub clauses (a) and (b) of clause ( 7 )","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 24 of Indian Constitution', 'Response': 'Prohibition of employment of children in factories, etc No child below the age of fourteen years shall be employed to work in any factory or mine or engaged in any other hazardous employment Provided that nothing in this sub clause shall authorise the detention of any person beyond the maximum period prescribed by any law made by Parliament under sub clause (b) of clause ( 7 ); or such person is detained in accordance with the provisions of any law made by Parliament under sub clauses (a) and (b) of clause ( 7 )"\nArticle 25 of Indian Constitution,"Freedom of conscience and free profession, practice and propagation of religion\n(1) Subject to public order, morality and health and to the other provisions of this Part, all persons are equally entitled to freedom of conscience and the right freely to profess, practise and propagate religion\n(2) Nothing in this article shall affect the operation of any existing law or prevent the State from making any law\n(a) regulating or restricting any economic, financial, political or other secular activity which may be associated with religious practice;\n(b) providing for social welfare and reform or the throwing open of Hindu religious institutions of a public character to all classes and sections of Hindus Explanation I The wearing and carrying of kirpans shall be deemed to be included in the profession of the Sikh religion Explanation II In sub clause (b) of clause reference to Hindus shall be construed as including a reference to persons professing the Sikh, Jaina or Buddhist religion, and the reference to Hindu religious institutions shall be construed accordingly","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 25 of Indian Constitution', 'Response': 'Freedom of conscience and free profession, practice and propagation of religion\n(1) Subject to public order, morality and health and to the other provisions of this Part, all persons are equally entitled to freedom of conscience and the right freely to profess, practise and propagate religion\n(2) Nothing in this article shall affect the operation of any existing law or prevent the State from making any law\n(a) regulating or restricting any economic, financial, political or other secular activity which may be associated with religious practice;\n(b) providing for social welfare and reform or the throwing open of Hindu religious institutions of a public character to all classes and sections of Hindus Explanation I The wearing and carrying of kirpans shall be deemed to be included in the profession of the Sikh religion Explanation II In sub clause (b) of clause reference to Hindus shall be construed as including a reference to persons professing the Sikh, Jaina or Buddhist religion, and the reference to Hindu religious institutions shall be construed accordingly"\nArticle 26 of Indian Constitution,"Freedom to manage religious affairs Subject to public order, morality and health, every religious denomination or any section thereof shall have the right\n(a) to establish and maintain institutions for religious and charitable purposes;\n(b) to manage its own affairs in matters of religion;\n(c) to own and acquire movable and immovable property; and\n(d) to administer such property in accordance with law","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 26 of Indian Constitution', 'Response': 'Freedom to manage religious affairs Subject to public order, morality and health, every religious denomination or any section thereof shall have the right\n(a) to establish and maintain institutions for religious and charitable purposes;\n(b) to manage its own affairs in matters of religion;\n(c) to own and acquire movable and immovable property; and\n(d) to administer such property in accordance with law"\nArticle 27 of Indian Constitution,"Freedom as to payment of taxes for promotion of any particular religion No person shall be compelled to pay any taxes, the proceeds of which are specifically appropriated in payment of expenses for the promotion or maintenance of any particular religion or religions denomination","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
{'Instruction': 'Article 27 of Indian Constitution', 'Response': 'Freedom as to payment of taxes for promotion of any particular religion No person shall be compelled to pay any taxes, the proceeds of which are specifically appropriated in payment of expenses for the promotion or maintenance of any particular religion or religions denomination"\nArticle 28 of Indian Constitution,"Freedom as to attendance at religious instruction or religious worship in certain educational institutions\n(1) No religion instruction shall be provided in any educational institution wholly maintained out of State funds\n(2) Nothing in clause ( 1 ) shall apply to an educational institution which is administered by the State but has been established under any endowment or trust which requires that religious instruction shall be imparted in such institution\n(3) No person attending any educational institution recognised by the State or receiving aid out of State funds shall be required to take part in any religious instruction that may be imparted in such institution or to attend any religious worship that may be conducted in such institution or in any premises attached thereto unless such person or, if such person is a minor, his guardian has given his consent thereto Cultural and Educational Rights","Below is an instruction that describes a task or a question. Write a response that appropriately completes the request.'}
